performance/api-endpoints-loadtest-uat.yml
config:
  target: "https://uat-api.aplustesting.org"
  plugins:
    expect: {}
    metrics-by-endpoint: {}
  phases:
    - duration: 1
      arrivalRate: 5
      name: Warm up
    - duration: 3
      arrivalRate: 5
      rampTo: 100
      name: Ramp up load
    - duration: 2
      arrivalRate: 100
      name: Sustained load

scenarios:
  - name: "POST /teacherlogin"
    flow:
      - post:
          url: "/teacherlogin"
          json: 
            email: "test@test.com"
            password: "test1234!"

  - name: "POST /studentLogin"
    flow:
      - post:
          url: "/studentLogin"
          json:
            first_name: "First001"
            last_name: "Last001"
            studentid: "4567891231"

  - name: "POST /loadmonitoring"
    flow:
      - post:
          url: "/loadmonitoring?token=fasdfsdafsdafds"
          json:
            class_id: "fsdsd"

  - name: "POST /pendinganswers"
    flow:
      - post:
          url: "/pendinganswers?token=$2b$10$3p2Jsd6LVZiWyZYusjBocO0XleN/p6FASJD90QNqy8tRvf.V/0L5y"
          json:
            data: 
              [
                {
                  question: 46,
                  answer: 1,
                  questionId: "m8_s003_q47",
                  totalTime: 62,
                  objective_id: "58e0b9f9c14ef5d10bc1c136"
                }
              ]
            current_question: 34
            total_time: 456
            student: "599da246ddb1e3fb7718c71f"
            classroom: "599d949ae52c7a0001de2ae1"
            test_id: "m8_s003"