performance/api-endpoints-loadtest-uat.yml
config:
  target: "https://uat-api.aplustesting.org"
  plugins:
    expect: {}
    metrics-by-endpoint: {}
  phases:
    - duration: 1
      arrivalRate: 100
      name: Warm up
    - duration: 30
      arrivalRate: 500
      rampTo: 30
      name: Ramp up load
    - duration: 60
      arrivalRate: 1000
      name: Sustained load
  payload:
    path: "student-credentials.csv"
    fields:
      - "_id"
      - "first"
      - "last"
      - "studentId"
      - "token"

scenarios:
  - name: "GET /getclassrooms"
    flow: 
      - get:
          url: "/getclassrooms?token{{token}}&studentId={{studentId}}&fName={{first}}&lname={{last}}"

  - name: "POST /loadmonitoring"
    flow:
      - post:
          url: "/loadmonitoring?token=$2b$10$M919ycCWi8j/1co8Wkb3R.izLfVWcDvbbpUjyUWx2.YhZDekIuSHS"
          json:
            class_id: "5dc48f8e38b8b71f751e5bdf"
  
  - name: "POST /questions"
    flow:
      - post:
          url: "/questions?token={{token}}"
          json: 
            student_id: "{{_id}}"
            class_id: "5dc48f8e38b8b71f751e5bdf"
            test_id: "m3_a_1_2"

  - name: "POST /pendinganswers"
    flow:
      - post:
          url: "/pendinganswers?token={{token}}"
          json:
            data: 
              [
                {
                  question: 0,
                  answer: 3,
                  questionId: "m3_a_1_2_q01",
                  totalTime: 5,
                  objective_id: "58e0b9f9c14ef5d10bc1c136"
                }
              ]
            random_array:
              [
                0,
                1,
                2,
                3,
                4
              ]
            current_question: 0
            total_time: 5
            student: "{{_id}}"
            classroom: "5dc48f8e38b8b71f751e5bdf"
            test_id: "m3_a_1_2"